In [2]:
import pandas as pd

In [3]:
salaryDataFile = 'SanFranciscoSalaries2011-2013.csv'

In [4]:
salaryData = pd.read_csv(salaryDataFile)

In [10]:
salaryData.head()

,Employee Name,Year,Employee ID,Job Title,Base Pay,Overtime Pay,Other Pay
0,A Bernard Fatooh,2011,29354,Sheriff'S Property Keeper,19969.37,0.0,70.54
1,Aaric Pingree,2011,72817,Carpenter,0.00,0.0,100.00
2,Aarom Peverill,2013,34121,Public Service Aide-Special Programs,3202.14,0.0,64.19
3,Aaron Obenyah,2012,105528,Publ Svc Aide-Asst To Prof,11577.00,0.0,0.00
4,Aaron Richmond,2011,109147,Public Svc Aide-Public Works,2175.41,0.0,46.36

In [6]:
salaryData.shape

(24285, 7)

In [7]:
salaryData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24285 entries, 0 to 24284
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Employee Name  24285 non-null  object
 1   Year           24285 non-null  int64
 2   Employee ID    24285 non-null  int64
 3   Job Title      24285 non-null  object
 4   Base Pay       24285 non-null  float64
 5   Overtime Pay   24285 non-null  float64
 6   Other Pay      24285 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 1.3+ MB

In [8]:
salaryData.describe()

,Year,Employee ID,Base Pay,Overtime Pay,Other Pay
count,24285.000000,24285.000000,24285.000000,24285.000000,24285.000000
mean,2012.010047,55309.756763,66061.492854,5036.355495,3725.260765
std,0.815644,32100.247256,42680.036186,11517.994545,8029.425852
min,2011.000000,7.000000,0.000000,0.000000,0.000000
25%,2011.000000,27390.000000,33114.520000,0.000000,0.000000
50%,2012.000000,55440.000000,64796.970000,0.000000,853.790000
75%,2013.000000,83139.000000,95015.860000,4657.550000,4312.110000
max,2013.000000,110529.000000,274126.500000,220909.480000,183112.410000

In [11]:
salaryData.head()

,Employee Name,Year,Employee ID,Job Title,Base Pay,Overtime Pay,Other Pay
0,A Bernard Fatooh,2011,29354,Sheriff'S Property Keeper,19969.37,0.0,70.54
1,Aaric Pingree,2011,72817,Carpenter,0.00,0.0,100.00
2,Aarom Peverill,2013,34121,Public Service Aide-Special Programs,3202.14,0.0,64.19
3,Aaron Obenyah,2012,105528,Publ Svc Aide-Asst To Prof,11577.00,0.0,0.00
4,Aaron Richmond,2011,109147,Public Svc Aide-Public Works,2175.41,0.0,46.36

## Let's find out the Highest Earner in 2011 based on Total Pay

Total pay equals base plus overtime plus other.

In [13]:
salaryData['Total Pay'] = salaryData['Base Pay'] + salaryData['Overtime Pay'] + salaryData['Other Pay']

In [18]:
# salaryData2011 = salaryData[salaryData['Year']==2013]
# salaryData2011.head()

,Employee Name,Year,Employee ID,Job Title,Base Pay,Overtime Pay,Other Pay,Total Pay
2,Aarom Peverill,2013,34121,Public Service Aide-Special Programs,3202.14,0.00,64.19,3266.33
10,Aaron Dunn,2013,13278,Transit Operator,65196.68,16571.53,2189.42,83957.63
16,Aaron Loukonen,2013,52003,Special Nurse,85759.06,2505.87,14044.74,102309.67
21,Aaron S Cramer,2013,79248,Registered Nurse,115372.35,8546.13,6484.78,130403.26
25,Aaron T Dunn,2013,86464,Transit Operator,68552.52,17182.65,2598.21,88333.38

In [28]:
salaryData.sort_values('Total Pay', ascending=False)

,Employee Name,Year,Employee ID,Job Title,Base Pay,Overtime Pay,Other Pay,Total Pay
7469,Gary Altenberg,2013,36160,"Lieutenant, Fire Suppression",128808.87,220909.48,13126.31,362844.66
22312,Thomas A Siragusa,2011,72935,Asst Chf Of Dept (Fire Dept),215265.60,88028.54,21526.49,324820.63
667,Alson Lee,2012,7,"Battalion Chief, (Fire Department)",92492.01,89062.90,134426.14,315981.05
15290,Marty Ross,2011,36173,"Battlion Chief, Fire Suppressi",174822.41,99623.51,36522.39,310968.31
17669,Patricia Jackson,2013,12,Captain Iii (Police Department),99722.00,87082.62,110804.30,297608.92
...,...,...,...,...,...,...,...,...
1091,Angel T Vanstark,2011,106971,"Commissioner 16.700C, No Pay",0.00,0.00,0.00,0.00
13587,Linda Carter,2011,70957,Transit Car Cleaner,0.00,0.00,0.00,0.00
12037,Kathleen Ruiz-Healy,2012,106806,"Commissioner 16.700C, No Pay",0.00,0.00,0.00,0.00
3572,Chris T Hyland,2011,106949,"Commissioner 16.700C, No Pay",0.00,0.00,0.00,0.00
20329,Samantha J Blanchard,2013,106600,Gardener,0.00,0.00,0.00,0.00